TimbradorCFDI2020/WsCFDi 11Feb2011/WsCFDi/Ejemplos/RequestEjemplo3ImpLocales.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.buzonfiscal.com/ns/xsd/bf/bfcorp/3" xmlns:ns1="http://www.buzonfiscal.com/ns/xsd/bf/remision/5" xmlns:implocal="http://www.sat.gob.mx/implocal">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:RequestGeneraCFDi>
         <ns1:Remision version="5.0">
            <ns1:InfoBasica rfcEmisor="AAA010101AAA" rfcReceptor="CCC010101CCC" serie="A" aliasSucursal="?" folio="10">
               <!--0 to 10 repetitions:-->
            </ns1:InfoBasica>
            <ns1:InfoAdicional formaDePago="Efectivo" subTotal="50" descuento="1" total="49" metodoDePago="Efectivo" tipoDeComprobante="ingreso" moneda="MXN" tipoCambio="1"/>
            <!--Optional:-->
            <ns1:Emisor nombre="Emisor Prueba"/>

            <ns1:Receptor nombre="Receptor Demo"/>
            <!--Optional:-->

            <ns1:Conceptos>
               <!--1 or more repetitions:-->
               <ns1:Concepto cantidad="1" unidad="X" descripcion="producto prueba" valorUnitario="50" importe="50">
               </ns1:Concepto>
            </ns1:Conceptos>
            <!--Optional:-->
            <ns1:Complemento>
               <implocal:ImpuestosLocales TotaldeTraslados="11.20" TotaldeRetenciones="4545.25"
            version="1.0">
            <implocal:RetencionesLocales Importe="10.12" TasadeRetencion="12.1"
                ImpLocRetenido="impuesto"/>
            <implocal:RetencionesLocales Importe="10.12" TasadeRetencion="3.23"
                ImpLocRetenido="otroimpuesto"/>
            <implocal:TrasladosLocales Importe="5.55" TasadeTraslado="55.12"
                ImpLocTrasladado="impuestotrasladado"/>
        </implocal:ImpuestosLocales>
            </ns1:Complemento>
            
         </ns1:Remision>
      </ns:RequestGeneraCFDi>
   </soapenv:Body>
</soapenv:Envelope>